{
  "chapters": [
    {
      "id": 1,
      "title": "Chapter 1354: Heavenly Sovereign Heaven and Earth Soul",
      "chapterNumber": 1354,
      "romanId": 1,
      "romanTitle": "Heavenly Sovereign",
      "author": "Master Chen",
      "authorId": 1,
      "status": "published",
      "content": "Chapter 1354: Chapter 1269 Heavenly Sovereign Heaven and Earth Soul\n\n\"Since I can't let the Alliance of Thousands of Immortals detect my plans, I could only sneak out a little bit of time each time.\n\nOriginally, I would have needed a long time to accumulate enough, but now…\"\nYan Fajue looked at Li Fan, \"Your method has been a great help!\"\nLi Fan, however, said, \"Forty years is still too long.\n\nMoreover, in order not to reveal any flaws, you must also be diverting a small part of your power to deal with the supervision of the Law Enforcement Hall while you sleep.\n\nIs there a way to shorten the time required even further?\"\n\"You really want to help me?\" Yan Fajue seemed a little shocked.\n\nBut seeing Li Fan's very serious expression, Yan Fajue thought for a moment before flying to his side and whispering in his ear, \"As I said before, practicing the Techniques is akin to cultivation for me.\n\nThe reason I need to sleep for fifty years to grow is because I need to organize and absorb the gains of cultivation.\n\nIf there's a way to skip this step, I'm afraid I would only need about five years…\n\nno, ten years should do!\"\n\"I vaguely remember, there is a treasure in the world known as 'Immortal Sound Jade Dew.' If I could consume some more of it…\"\nYan Fajue's mouth corners were faintly drooling.\n\n\"Immortal Sound Jade Dew?\" Li Fan frowned slightly upon hearing this.\n\nwuxiaworld.site\n\n\"Are you sure this is something from the Xuanhuang World?\"\nLi Fan, having been through hundreds of reincarnations and possessing the origin of the Tianxuan Mirror, holding the Tablet of Creation, could say that there were hardly any Heavenly Materials and Earthly Treasures in the Xuanhuang World that he was unaware of.\n\nBut this Immortal Sound Jade Dew, he truly heard of for the first time.\n\n\"Uha…| I don't know,\" Yan Fajue, upon hearing Li Fan say this, was suddenly a bit dumbfounded.\n\n\"But I'm certain that Immortal Sound Jade Dew really exists in the world,\" the little lass said with conviction.\n\nAfter a brief silence, Li Fan replied, \"I will find a way.\"\nUpon hearing this, Yan Fajue's eyes widened in surprise, and she couldn't help saying, \"You really are a good person!\"\nLi Fan said, \"Aren't you afraid that I'm a person from the Alliance of Thousands of Immortals?\n\nThat everything I've said is a lie…\"\nYan Fajue chuckled, \"This lady here isn't foolish.\n\nYou're different from those who pass on the Law.\n\nMoreover, I can tell at a glance who has ill intentions and who is sincere!\"\nLi Fan smiled, offering no rebuttal.\n\n\"Then you should rest well for now.\n\nI'll contact you if there's any news.\"\nThe light and shadow twisted, and the imitation persona returned to its original state, taking over Yan Fajue's work relentlessly.\n\nAfter Yan Fajue observed for a while and was sure that there would be no slip-ups, she contentedly assumed the spread-eagled position again and dozed off in midair.\n\n\"Yan Fajue's true form, even if it's not from the Immortal World, must also be like the Xuanhuang World, boasting a special Cultivating Immortality World with a Realm Defensive Array.\"\n\"With her current abilities, she's no longer of much help to me.\n\nBut if she could take a step further and be able to infer Immortal Law…\"\nLi Fan had already tasted the sweetness brought by the crushing superiority of Array Path over generations; if he could achieve the same in the realm of Techniques, his future endeavors would be much easier.\n\nYan Fajue's sense was correct… to an extent.\n\nIndeed, Li Fan harbored no ill will toward her at the moment.\n\nHe merely planned to help her break free from the control of the Alliance of Thousands of Immortals.\n\nIn the process, he would use the promise of a successful escape to make Yan Fajue acknowledge him as her master.\n\nBy the end of this life, he should be able to choose to keep Yan Fajue.\n\nThus, the Xuanhuang World would unprecedentedly witness two of the same Heaven's Oddities.\n\nAnd with decades more experience in the Techniques, the Yan Fajue retained by Li Fan should be the slightly stronger of the two.\n\nAccording to what Li Fan had previously discovered, the pattern of the weak perishing and the strong surviving would mean that the Yan Fajue of the Alliance of Thousands of Immortals would inexplicably disappear.\n\nThe one in Li Fan's hands would, after fusion, achieve a breakthrough and transcend.\n\nA perfect plan.\n\nThe prerequisite was to successfully make Yan Fajue acknowledge her master.\n\nBefore that, it wouldn't hurt to indulge her a little.\n\nEven if the goal was not achieved this life, with the experience of living together for hundreds of years and the secrets extracted, making Yan Fajue acknowledge him as master in the future wouldn't be difficult.\n\n\"Of course, the Dissociation Disc and Yan Fajue, they are just tools.\n\nTo truly reach Enlightenment and find the transcendence method, I have to rely on myself.\"\nLi Fan's mind was clear.\n\nBefore finding a way to break free from the shackles of the Law Transmission system, it wouldn't hurt to continue on the current path.\n\nAfter all, with the advantage of being reborn through Reincarnation, cultivating step by step is much easier than creating something from nothing.\n\n\"Xuanhuang will change and then become the Essence of Heaven and Earth.\"\n\"With my current strength, even if I absorbed hundreds of Essences of the Heavenly Path, I might not see a qualitative leap in strength.\n\nAfter all, during the moments of Xuanhuang's destruction, each Change of Life strives to survive, and it might not be any less than the Essences of the Heavenly Path from the peaceful Xuanhuang World.\"\n\"This life, using The Emperor to test the true strength of Law Transmission and the Celestial Doctor.\n\nThe next life is to take this step and strive to close the gap between us.\n\nRead latest Chapters at WuxiaWorld.Site Only\n\nEven achieve a balance of power!\"\n\"Relying on ordinary Essences of Heaven and Earth would certainly not suffice.\"\nThanks to the close connection between The Emperor and the Xuanhuang Heaven Path in this life, Li Fan has learned more secrets of the Heavenly Path.\n\nThe Essence of Heaven and Earth is born from the Heavenly Duty and is the manifestation of the Xuanhuang Law.\n\nCrimson Flame, Mo Sha and the like represent single-attribute Essences of Heaven and Earth.\n\nUnder very special circumstances, the Xuanhuang World would spontaneously evolve Essences of Heaven and Earth with [Compound Attributes].\n\nLi Fan, having once coincidentally given birth to the [Heavenly Dao Bai] through the Sacred Embryo, was among this category.",
      "wordCount": 3847,
      "submittedAt": "2024-01-20",
      "publishedAt": "2024-01-25",
      "views": 1250,
      "isVerified": true,
      "comment": "Excellent chapitre avec une intrigue complexe et bien développée.",
      "moderationStatus": "approved",
      "moderatedAt": "2024-01-22",
      "moderatedBy": "Admin Chen"
    },
    {
      "id": 2,
      "title": "Chapter 1355: The Jade Dew Mystery",
      "chapterNumber": 1355,
      "romanId": 1,
      "romanTitle": "Heavenly Sovereign",
      "author": "Master Chen",
      "authorId": 1,
      "status": "pending",
      "content": "Chapter 1355: The Jade Dew Mystery\n\nThe morning sun cast its golden rays across the Heavenly Pavilion as Li Fan contemplated the previous night's revelation. The mention of Immortal Sound Jade Dew had stirred something deep within his vast repository of knowledge from countless reincarnations.\n\n\"Perhaps,\" he mused to himself, \"the answer lies not in the Xuanhuang World itself, but in the spaces between worlds.\"\n\nHis meditation was interrupted by a subtle shift in the ambient spiritual energy. Yan Fajue was stirring from her slumber, her ethereal form beginning to manifest more solidly in the physical realm.\n\n\"Master Li Fan,\" she said, her voice carrying a note of urgency, \"I've remembered something important during my rest. The Jade Dew... it's not from any single world.\"\n\nLi Fan's eyes sharpened with interest. \"Continue.\"\n\n\"In my fragmented memories, I recall a place called the Void Garden—a nexus point where multiple cultivation worlds intersect. It's said that the garden produces treasures that exist in quantum superposition, belonging to all worlds and none simultaneously.\"\n\nThe implications of her words struck Li Fan like lightning. If such a place existed, it would explain why he had no knowledge of the Immortal Sound Jade Dew despite his extensive experience across reincarnations.\n\n\"The Alliance of Thousands of Immortals,\" Yan Fajue continued, \"they've been secretly harvesting from the Void Garden for millennia. That's how they maintain their stranglehold on cultivation resources across multiple realms.\"\n\nLi Fan felt the pieces of a vast cosmic puzzle beginning to fall into place. The Alliance wasn't just controlling the Xuanhuang World—they were manipulating the very fabric of inter-dimensional cultivation.",
      "wordCount": 2143,
      "submittedAt": "2024-01-25",
      "publishedAt": null,
      "views": 0,
      "isVerified": false,
      "comment": null,
      "moderationStatus": "pending",
      "moderatedAt": null,
      "moderatedBy": null
    },
    {
      "id": 3,
      "title": "Chapter 1356: Shadows of the Alliance",
      "chapterNumber": 1356,
      "romanId": 1,
      "romanTitle": "Heavenly Sovereign",
      "author": "Master Chen",
      "authorId": 1,
      "status": "accepted_unpublished",
      "content": "Chapter 1356: Shadows of the Alliance\n\nThe ancient cultivator's awakening sent ripples through the Alliance's vast network of surveillance arrays. Elder Xu Tianming, dormant for three hundred years, now sat in the heart of the Celestial Observatory, his consciousness expanding across dimensions.\n\n\"Summon the Shadow Council,\" his voice echoed through crystalline communication networks that spanned galaxies. \"The Anomaly has learned of the Garden.\"\n\nWithin moments, spectral forms began materializing around the obsidian conference table. Each member of the Shadow Council represented a different aspect of the Alliance's power: temporal manipulation, dimensional warfare, soul harvesting, and reality restructuring.\n\n\"Elder Xu,\" spoke Councilor Mei, her form flickering between dimensions, \"the Anomaly's pattern is... troubling. Our precognitive algorithms cannot lock onto his future trajectory.\"\n\n\"That's because he exists outside the normal flow of causality,\" replied Xu Tianming. \"His reincarnation cycles have created quantum entanglement with multiple timeline branches. He is, in essence, a living paradox.\"\n\nCouncilor Zhang, master of the soul arts, leaned forward. \"Should we eliminate him directly? Our Void Assassins could—\"\n\n\"No.\" Xu Tianming's word cut through the suggestion like a blade. \"Direct action would only strengthen his resolve and potentially alert other anomalies to our operations. We must be... subtle.\"\n\nMeanwhile, in the Heavenly Pavilion, Li Fan felt a chill run down his spine. His extensive experience with danger had honed his instincts to a razor's edge, and something was definitely amiss.\n\n\"Yan Fajue,\" he said quietly, \"we need to accelerate our plans. The Alliance knows.\"\n\nThe ethereal being's eyes widened with alarm. \"How can you be certain?\"\n\n\"The spiritual pressure in the air has changed. They're watching us—and not just through conventional means. This feels like... dimensional scrying.\"\n\nYan Fajue's form began to flicker with agitation. \"If they know about our conversation regarding the Void Garden, they'll mobilize their Erasure Protocols. We have perhaps a day before they act.\"",
      "wordCount": 2567,
      "submittedAt": "2024-01-26",
      "publishedAt": null,
      "views": 0,
      "isVerified": true,
      "comment": "Bon développement de l'intrigue avec l'Alliance. Quelques détails à ajuster concernant la temporalité.",
      "moderationStatus": "approved",
      "moderatedAt": "2024-01-27",
      "moderatedBy": "Admin Li"
    },
    {
      "id": 4,
      "title": "Chapter 1357: The Void Crossing",
      "chapterNumber": 1357,
      "romanId": 1,
      "romanTitle": "Heavenly Sovereign",
      "author": "Master Chen",
      "authorId": 1,
      "status": "unpublished",
      "content": "Chapter 1357: The Void Crossing\n\nThe dimensional barrier between worlds felt like walking through liquid starlight. Li Fan gritted his teeth as reality warped around them, his body experiencing the uncomfortable sensation of existing in multiple states simultaneously.\n\n\"Stay close,\" Yan Fajue warned, her ethereal form serving as an anchor point in the chaotic void between realms. \"The Void Streams are particularly turbulent during the Lunar Convergence.\"\n\nThrough the swirling cosmic maelstrom, Li Fan could see fragments of other worlds flashing past—desert kingdoms where sand moved like water, forest realms where trees grew downward into the sky, technological civilizations that had merged flesh with starlight.\n\n\"How many worlds are connected to this void network?\" he asked, dodging a particularly violent stream of temporal energy.\n\n\"Countless,\" Yan Fajue replied. \"Every world that has achieved transcendence beyond the Third Realm creates a node in the Void Network. The Alliance discovered this eons ago and has been exploiting it ever since.\"\n\nSuddenly, the void around them began to darken. What had been swirling streams of cosmic energy started coalescing into more sinister forms.\n\n\"Void Wraiths,\" Yan Fajue hissed. \"The Alliance has sent hunters.\"\n\nLi Fan could see them now—beings of pure negative space, creatures that existed by consuming the light and life of other entities. They moved through the void like sharks through water, their presence causing reality itself to fray at the edges.\n\n\"Can we outrun them?\"\n\n\"Not in the traditional sense. But...\" Yan Fajue's eyes suddenly blazed with inspiration. \"What if we don't run from them? What if we run through them?\"\n\nBefore Li Fan could ask what she meant, Yan Fajue grabbed his hand and pulled him directly toward the largest cluster of Void Wraiths. As they approached, Li Fan felt his life force beginning to drain away.\n\n\"Trust me,\" Yan Fajue whispered, and suddenly Li Fan understood her plan.\n\nThe Void Wraiths consumed energy by creating perfect vacuum in space-time. But what they couldn't consume was pure potential—energy that existed in quantum superposition, neither real nor unreal.\n\nLi Fan accessed his deepest reincarnation memories, tapping into knowledge from a life where he had studied quantum cultivation. Together, he and Yan Fajue shifted their existence into a state of pure possibility.\n\nThe Void Wraiths passed through them like shadows through light, unable to grasp what wasn't quite there.\n\nWhen they emerged on the other side, the Void Garden lay before them—a realm where impossible flowers bloomed in colors that had no names, where the Immortal Sound Jade Dew condensed from the music of the spheres themselves.\n\n\"We made it,\" Li Fan breathed, hardly believing their success.\n\nBut Yan Fajue's expression remained troubled. \"The easy part is over,\" she said grimly. \"Now we have to survive what guards the Garden.\"\n\nIn the distance, something vast and ancient stirred, awakened by their arrival. The true test was just beginning.",
      "wordCount": 2234,
      "submittedAt": "2024-01-28",
      "publishedAt": "2024-01-30",
      "views": 892,
      "isVerified": true,
      "comment": "Chapitre dépublié suite à des incohérences temporelles avec les chapitres précédents. Révision nécessaire.",
      "moderationStatus": "revision_requested",
      "moderatedAt": "2024-02-01",
      "moderatedBy": "Admin Wang"
    },
    {
      "id": 5,
      "title": "Chapter 1358: Guardian of the Garden",
      "chapterNumber": 1358,
      "romanId": 1,
      "romanTitle": "Heavenly Sovereign",
      "author": "Master Chen",
      "authorId": 1,
      "status": "published",
      "content": "Chapter 1358: Guardian of the Garden\n\nThe Guardian of the Void Garden was unlike anything Li Fan had encountered in his countless reincarnations. It wasn't a creature in any conventional sense, but rather a living embodiment of the Garden's purpose—a consciousness born from the collective will of all the worlds connected to the Void Network.\n\n\"Who dares enter the Nexus of Infinity?\" The voice came from everywhere and nowhere, reverberating through dimensions that existed parallel to their current reality.\n\nLi Fan stepped forward, his cultivation base radiating calm confidence despite the overwhelming presence before them. \"I am Li Fan, seeker of truth and defier of the Alliance's tyranny. This is Yan Fajue, rightful inheritor of the Technique Arts.\"\n\n\"The Alliance...\" The Guardian's voice carried undertones of ancient sadness. \"How long has it been since someone mentioned that name without fear? Tell me, Li Fan of Many Lives, what brings you to seek the Immortal Sound Jade Dew?\"\n\nThe title caught Li Fan off guard. How did the Guardian know about his reincarnations?\n\n\"You wonder how I know,\" the Guardian continued, seeming to read his thoughts. \"I have watched the cycles of your soul across time and space. You are not the first to seek freedom from the Alliance's chains, but you may be the first with the potential to succeed.\"\n\nYan Fajue moved closer to Li Fan, her ethereal form glowing with nervous energy. \"Guardian, the Alliance has corrupted the natural order. They harvest from this Garden to maintain their stranglehold on cultivation progress across multiple realms.\"\n\n\"Indeed they do,\" the Guardian acknowledged. \"And in doing so, they have upset the balance that has maintained inter-dimensional stability for eons. The Void Network grows unstable. Soon, the barriers between worlds may collapse entirely.\"\n\nLi Fan felt a chill of understanding. \"That's their true plan, isn't it? They're not just controlling individual worlds—they're orchestrating a controlled collapse of the dimensional barriers to create a single, unified realm under their absolute dominion.\"\n\n\"Precisely. And when that happens, concepts like reincarnation, alternate timelines, and quantum possibility will cease to exist. There will be only one reality—theirs.\"\n\nThe implications were staggering. Li Fan's greatest advantage—his ability to retain knowledge across multiple lives—would become meaningless in such a universe.\n\n\"The Immortal Sound Jade Dew,\" the Guardian continued, \"is more than just a cultivation aid. It's a crystallization of pure potential—the essence of what could be, rather than what is. In the right hands, it could serve as an anchor point to preserve the current dimensional structure.\"\n\n\"And in the wrong hands?\"\n\n\"It becomes the key to accelerating the collapse.\" The Guardian's form shifted, revealing glimpses of the cosmic devastation that would follow. \"The Alliance believes they can control such a collapse. They are... mistaken.\"\n\nYan Fajue stepped forward. \"Then give us the Jade Dew. Help us stop them.\"\n\n\"I cannot simply give it to you,\" the Guardian replied. \"The Dew must be earned through trials that prove your worthiness. But know this—the trials will test not just your power, but your understanding of sacrifice, wisdom, and the true meaning of freedom.\"\n\nLi Fan nodded grimly. \"We accept.\"\n\n\"Then let the Trials of Infinite Possibility begin.\"\n\nThe Garden around them began to shift and change, reality bending as the first trial manifested. Li Fan and Yan Fajue exchanged a determined look—their greatest challenge yet was about to commence.",
      "wordCount": 2789,
      "submittedAt": "2024-02-01",
      "publishedAt": "2024-02-03",
      "views": 1567,
      "isVerified": true,
      "comment": "Excellent chapitre qui pose bien les enjeux cosmiques de l'arc narratif.",
      "moderationStatus": "approved",
      "moderatedAt": "2024-02-02",
      "moderatedBy": "Admin Chen"
    }
  ]
} 
 
 
 